<?
$q[1]="สามารถเข้าถึงบริการได้ง่าย ขั้นตอนในการให้บริการมีความคล่องตัว ไม่ยุ่งยาก ซับซ้อน";
$q[]="กระบวนการในการให้บริการเหมาะสม และรวดเร็วฉับไว";
$q[]="เจ้าหน้าที่ให้บริการ ดูแลเอาใจใส่ กระตือรือร้น เต็มใจให้บริการ";
$q[]="การให้คำปรึกษาและตอบข้อซักถามเกี่ยวกับเครื่องคอมพิวเตอร์และอุปกรณ์ต่อพ่วง";
$q[]="มีอุปกรณ์คอมพิวเตอร์ สื่อโสตทัศน์ เทคโนโลยีที่ทันสมัย เพียงพอและเหมาะสม";
$q[]="มีส่วนร่วมในการให้ข้อมูลลงฐานข้อมูล";
$q[]="ความถูกต้อง ชัดเจน น่าเชื่อถือของข้อมูล";
$q[]="การให้บริการฐานข้อมูลและการค้นหาครบถ้วน";
$q[]="ความทั่วถึงของระบบเครือข่ายคอมพิวเตอร์ครอบคลุมไปถึงทุกหน่วยงาน";
$q[]="ได้รับการให้บริการตรงกับความต้องการ";
$q[]="ความทันสมัยของอุปกรณ์ โปรแกรมที่ให้บริการ";
$q[]="ชี้แจงและให้คำแนะนำเกี่ยวกับการให้บริการที่ชัดเจน";
$q[]="ประสิทธิภาพการใช้งานหลังการให้บริการ";
$q[]="โปรแกรมคอมพิวเตอร์มีประโยชน์ต่อผู้ใช้";
$q[]="มีระบบช่วยในการเข้าใช้ข้อมูล กรณีที่เกิดปัญหา";
$q[]="โดยภาพรวมทั้งหมดท่านมีความพึงพอใจอยู่ในระดับใด";
?>
