<?php
   session_start();
   print "<p><b><font face='Angsana New'>โรงพยาบาลค่ายสุรศักดิ์มนตรี</font></b></p>";
   print "<p><font face='Angsana New'>ชื่อ $cPtname  HN: $cHn</font></p>";
?>
<form method="POST" action="appinsert.php">
  <p><font face="Angsana New">นัดมาวันที่&nbsp;&nbsp;&nbsp;&nbsp;
  <input type="text" name="appdate" size="2">&nbsp;&nbsp;&nbsp; เดือน&nbsp;<select size="1" name="appmo">
    <option selected>--เลือก--</option>
    <option value="01">มกราคม</option>
    <option value="02">กุมภาพันธ์</option>
    <option value="03">มีนาคม</option>
    <option value="04">เมษายน</option>
    <option value="05">พฤษภาคม</option>
    <option value="06">มิถุนายน</option>
    <option value="07">กรกฎาคม</option>
    <option value="08">สิงหาคม</option>
    <option value="09">กันยายน</option>
    <option value="10">ตุลาคม</option>
    <option value="11">พฤษจิกายน</option>
    <option value="12">ธันวาคม</option>
  </select>&nbsp;&nbsp; พ.ศ.<input type="text" name="thiyr" size="4" value="2546">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
  เวลา&nbsp; <input type="text" name="apptime" size="8" value="09:30:00"></font></p>
  <p><font face="Angsana New">นัดมาที่(ห้อง)&nbsp;&nbsp;&nbsp;&nbsp; <input type="text" name="depart" size="20" value="ห้องตรวจ">&nbsp;&nbsp;</font></p>
  <p><font face="Angsana New">เพื่อ&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
  <input type="text" name="detail" size="40" value="ติดตามผลการรักษา"></font></p>
  <p><font face="Angsana New">ข้อแนะนำ&nbsp; <input type="text" name="advice" size="40"></font></p>

    <p><font face="Angsana New">แพทย์ผู้นัด&nbsp; <select size="1" name="doctor">
    <option selected>--&#3648;&#3621;&#3639;&#3629;&#3585;&#3649;&#3614;&#3607;&#3618;&#3660;&#3607;&#3637;&#3656;&#3626;&#3633;&#3656;&#3591;---</option>
    <option>MD001 &#3621;&#3634;&#3616;&#3594;&#3633;&#3618;
    &#3648;&#3624;&#3619;&#3625;&#3600;&#3607;&#3633;&#3605;&#3605;&#3660;</option>
    <option>MD002
    &#3600;&#3636;&#3605;&#3636;&#3623;&#3633;&#3602;&#3609;&#3660;
    &#3594;&#3656;&#3634;&#3591;&#3611;&#3619;&#3632;&#3604;&#3633;&#3610;</option>
    <option>MD003 &#3586;&#3640;&#3609;&#3624;&#3638;&#3585;
    &#3586;&#3634;&#3623;&#3626;&#3635;&#3621;&#3637;</option>
    <option>MD004 &#3616;&#3634;&#3588;&#3618;&#3660;
    &#3650;&#3621;&#3627;&#3634;&#3619;&#3594;&#3640;&#3609;</option>
    <option>MD005 &#3629;&#3617;&#3619;&#3636;&#3609;&#3607;&#3619;&#3660;
    &#3623;&#3619;&#3619;&#3603;&#3632;&#3623;&#3633;&#3621;&#3618;&#3660;</option>
    <option>MD006 &#3648;&#3621;&#3639;&#3629;&#3585;
    &#3604;&#3656;&#3634;&#3609;&#3626;&#3623;&#3656;&#3634;&#3591;</option>
    <option>MD007 &#3603;&#3619;&#3591;&#3588;&#3660;
    &#3611;&#3619;&#3637;&#3604;&#3634;&#3629;&#3609;&#3633;&#3609;&#3607;&#3626;&#3640;&#3586;</option>
    <option>MD008 &#3629;&#3619;&#3619;&#3603;&#3614;
    &#3608;&#3619;&#3619;&#3617;&#3621;&#3633;&#3585;&#3625;&#3617;&#3637;</option>
    <option>MD009 &#3609;&#3616;&#3626;&#3617;&#3619;
    &#3608;&#3619;&#3619;&#3617;&#3621;&#3633;&#3585;&#3625;&#3617;&#3637;</option>
    <option>MD010 &#3626;&#3640;&#3608;&#3637;
    &#3619;&#3633;&#3605;&#3609;&#3634;&#3608;&#3619;&#3619;&#3617;&#3623;&#3633;&#3602;&#3609;&#3660;</option>
    <option>MD011 &#3629;&#3609;&#3640;&#3614;&#3591;&#3625;&#3660;
    &#3619;&#3629;&#3604;&#3626;&#3634;&#3618;</option>
    <option>MD012 &#3610;&#3640;&#3597;&#3594;&#3633;&#3618;
    &#3610;&#3640;&#3597;&#3623;&#3640;&#3602;&#3609;&#3660;</option>
    <option>MD013
    &#3608;&#3609;&#3610;&#3604;&#3636;&#3609;&#3607;&#3619;&#3660;
    &#3612;&#3621;&#3624;&#3619;&#3637;&#3609;&#3634;&#3588;</option>
    <option>MD014 &#3626;&#3617;&#3633;&#3594;&#3594;&#3634;
    &#3648;&#3610;&#3637;&#3657;&#3618;&#3592;&#3619;&#3633;&#3626;</option>
    <option>MD015 &#3624;&#3640;&#3616;&#3594;&#3633;&#3618;
    &#3588;&#3641;&#3626;&#3640;&#3623;&#3619;&#3619;&#3603;</option>
    <option>MD016 &#3629;&#3633;&#3624;&#3623;&#3636;&#3609;
    &#3649;&#3585;&#3657;&#3623;&#3648;&#3609;&#3605;&#3619;</option>
    <option>MD017 &#3626;&#3636;&#3607;&#3608;&#3636;&#3594;&#3633;&#3618;
    &#3592;&#3636;&#3605;&#3626;&#3617;&#3592;&#3636;&#3609;&#3605;&#3660;</option>
    <option>MD018 &#3626;&#3640;&#3619;&#3633;&#3605;&#3609;&#3660;
    &#3648;&#3611;&#3634;&#3609;&#3636;&#3621;</option>
    <option>MD019
    &#3648;&#3626;&#3619;&#3636;&#3617;&#3610;&#3633;&#3605;&#3636;
    &#3619;&#3656;&#3617;&#3648;&#3618;&#3655;&#3609;</option>
    <option>MD020
    &#3627;&#3609;&#3638;&#3656;&#3591;&#3620;&#3607;&#3633;&#3618;
    &#3617;&#3627;&#3634;&#3618;&#3624;&#3609;&#3633;&#3609;&#3607;&#3660;</option>
    <option>MD021 &#3609;&#3636;&#3623;&#3633;&#3602;&#3609;&#3660;
    &#3610;&#3640;&#3597;&#3618;&#3639;&#3609;</option>
    <option>MD022
    &#3652;&#3617;&#3656;&#3607;&#3619;&#3634;&#3610;&#3649;&#3614;&#3607;&#3618;&#3660;</option>
  </select></font></p>

  <p>&nbsp;&nbsp;&nbsp;<input type="submit" value="  ตกลง  " name="B1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<input type="reset" value="  ลบทิ้ง  " name="B2"></p>
</form>

