<?php 
require_once 'bootstrap.php';
require_once 'class_file/OpdReceive.php';

$dbi = new mysqli(HOST,USER,PASS,DB);

$hn = $_REQUEST['hn'];
$vn = $_REQUEST['vn'];

$a = new OpdReceive();
$a->hn = $hn;
$a->vn = $vn; 
$a->clinicalinfo = 'ตรวจสุขภาพประจำปี66';
//     // $a->custom_labnumber = '6509200301';
$a->orderLab($_REQUEST['labSelect']);

/**
 * what am i doing next
 * [] กลับไปดูหน้าตรวจสุขภาพทหารว่าบันทึกแล้วทำอะไรต่อ
 * [] ปริ้นสติกเกอร์แลป??
 * [] เพิ่มลิ้งกลับไปหน้าแรก??
 * [] แสดงรายการที่เคยคิดค่าใช้จ่ายไปแล้วในหน้าเลือกผลแลป
 *      [] แยกด้วยว่าเป็น ปกส.กี่บาท
 *      [] เป็นเงินสดกี่บาท
 * [] ตามข้อด้านบน คือจะให้คำนวณค่าใช้จ่ายที่แยกจากไฟล์ excel ของพี่อึ่งรึป่าว ???
 */

/**
 * Requirement เพิ่มเติมในวันที่ 23-09-65 คือ
 * พี่สมยศบอกว่า ผอ. ให้ตรวจแลปทุกคนเหมือนๆกัน เพราะฉะนั้นก็จะเหลือที่จะต้องคุยกับพี่อึ่งก็คือ
 * - การเงินจะแยกรายการรึป่าว ว่านาย A ใช้สิทธิประกันสังคมไปกี่บาท แล้วที่เหลือเป็นเงินสดที่ต้องจ่ายอีกกี่บาท
 */

echo "บันทึกข้อมูลเรียบร้อย";