<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-874" />
<title>สรุปประวัติการป่วยเจ็บและการรักษาพยาบาล</title>
<style type="text/css">
body,td,th {
	font-family: "TH SarabunPSK";
}
</style>
</head>

<body>
<p align="center">(7)สรุปประวัติการป่วยเจ็บและการรักษาพยาบาล( รง.ผสต.7ม ทบ.466-612 หรือ พ.33)</p>
<table width="62%" border="1" align="center" cellpadding="0" cellspacing="0">
  <tr>
    <td align="center"><strong>สรุปประวัติการป่วยเจ็บและการรักษาพยาบาล( รง.ผสต.7ม ทบ.466-612 หรือ พ.33)</strong></td>
  </tr>
  <tr>
    <td height="1233" valign="top"><blockquote>
      <p> ยศ,ชื่อผู้ป่วยเจ็บ   ................................................................................อายุ ...........................ปี สังกัด....................................... ค. ส. ม. ย.</p>
      <p>ภูมิลำเนา.............................................................................. ศาสนา.............................................................. เชื้อชาติ............................</p>
      <p>รับไว้รักษาเมื่อ วันที่.................................................เดือน................................................................โดย...................................................</p>
      <p>เคยเข้าป่วยเจ็บในสถานพยาบาล................ครั้ง ด้วยโรค..........................................................................................................................</p>
      ...................................................................................................................................................................................................................
      <p><strong><U>ประวัติการป่วยเจ็บและการตรวจร่างกายโดยย่อ</U></strong></p>
      <p>&nbsp;</p>
      <p>&nbsp;</p>
      <p>&nbsp;</p>
      <p>&nbsp;</p>
      <p><U><strong>การวินิจฉัยโรค</strong></U></p>
      <p>&nbsp;</p>
      <p><U><strong>การรักษา</strong></U></p>
      <p>&nbsp;</p>
      <p><U>จำหน่ายผู้ป่วยโดย</U> หาย	ทุเลา	ไม่ทุเลา หนี ปลดพ้นราชการ	ถึงแก่กรรม </p>
      <p>ผู้ป่วยเจ็บไม่สมัครใจรักษาต่อ ส่งผู้ป่วยเจ็บไปรักษาที่อื่น ส่งไปที่</p>
      <p>จำหน่าย เมื่อวันที่........... เดือน.......................................... พศ. ....................รวมวันรักษาตัวในสถานพยาบาล.............. วัน</p>
      <p>รักษาโดยแผนก........................................................ กอง................................................... หน่วย</p>
      <p>เมื่อออกจากสถานพยาบาลแล้วแพทย์ให้ความเห็นให้พักผ่อนต่อ มีกำหนด.............................................................................................................วัน</p>
      <p>การป่วยเจ็บเกี่ยวเนื่องกับการปฏิบัติราชการหรือไม่</p>
      <p><U><strong>ความเห็นอื่นๆ</strong></U></p>
      <p>&nbsp;</p>
      <p>แพทย์ผู้รักษา..............................................................................................................................  ตำแหน่ง</p>
      <p>(ชื่อและนามสกุลตัวบรรจง)</p>
      <p>&nbsp;</p>
      <p>&nbsp;</p>
    </blockquote>    </td>
  </tr>
</table>
<p align="center">&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
</body>
    </form>
</html>
