<?php
include 'bootstrap.php';
include 'fpdf_thai/shspdf.php';

$id = input_get('id');

$db = Mysql::load();
$sql = "SELECT a.*,b.`idcard`,b.`phone`,b.`dbirth` 
FROM `rg_soldier` AS a 
LEFT JOIN `opcard` AS b ON b.`hn` = a.`hn` 
WHERE a.`id` = '$id' ";
$db->select($sql);
$user = $db->get_item();


function toUTF($txt){
    return iconv('UTF-8', 'TIS-620', $txt);
}

$en_to_thai_num = array('1' => '๑','2' => '๒','3' => '๓','4' => '๔','5' => '๕','6' => '๖','7' => '๗','8' => '๘','9' => '๙','0' => '๐');

function thaiNum($number){
    
	global $en_to_thai_num;
	$lists = str_split($number);
	$th_str = '';

	foreach( $lists as $key => $item ){

		if( isset($en_to_thai_num[$item]) ){
			$th_str .= $en_to_thai_num[$item];
		}else{
			$th_str .= $item;
		}
		
	}
	return $th_str;
}

// return only age
function calcage($birth){
	$today = getdate();   
	$nY  = $today['year']; 
	$nM = $today['mon'] ;
	$bY=substr($birth,0,4)-543;
	$bM=substr($birth,5,2);
	$ageY=$nY-$bY;
	return $ageY;
}


$yearchk = $user['yearchk'];
$img_idcard = "images/idcard_exam.jpg";
$pic_patient = "images/p2_exam.jpg";
if( !empty($user['idcard_img']) && is_file("certificate/$yearchk/".$user['idcard_img']) ){
    $img_idcard = "certificate/$yearchk/".$user['idcard_img'];
}
if( !empty($user['pic_patient']) && is_file("certificate/$yearchk/".$user['pic_patient']) ){
	$pic_patient = "certificate/$yearchk/".$user['pic_patient'];
}

// list($date, $time) = explode(' ',$user['date_certificate']);
list($y, $m, $d) = explode('-', $user['date_certificate']);

$pdf = new SHSPdf('P', 'mm', 'A4');
$pdf->SetThaiFont(); // เซ็ตฟอนต์
$pdf->SetAutoPageBreak(false, 0);
$pdf->SetMargins(0,0,0); // left, top, right
$pdf->AddPage();

// ตั้งค่าเส้นประ
$pdf->SetLineWidth(0.1);
$pdf->SetDash(0.3, 0.6);

// ทดสอบความกว้าง
// $pdf->SetFont('THSarabun','',20);
// $pdf->SetXY(0, 0);
// $pdf->Cell(0, 5, $pdf->GetPageWidth().' '.$pdf->GetPageHeight(), 1, 1, 'C');

// $pdf->Image("images/bg-a4.jpg", 10, 0, 210, 297);

// ตราครุฑ
// $pdf->Image("images/krut-3-cm.jpg", 97, 15, 27, 30);

$fontSize = 16;

$pdf->SetFont('THSarabun','B',$fontSize);
// $pdf->SetXY(30, 26);
// $pdf->Cell(160, 8, 'เล่มที่ '.thaiNum($user['book_id']).'   เลขที่ '.thaiNum($user['number_id']), 0, 1);
$pdf->SetXY(30, 15);
$pdf->Cell(160, 8, 'หนังสือให้ความยินยอมในการเปิดเผยข้อมูล', 0, 1, 'C');
$pdf->Ln();

$pdf->SetFont('THSarabun','',$fontSize);
$pdf->SetX(110);
$pdf->Cell(80, 8, 'เขียนที่............................................................................', 0, 1, 'L');
$pdf->SetXY(128, $pdf->getY()-8);
$pdf->Cell(80, 8, 'โรงพยาบาลค่ายสุรศักดิ์มนตรี', 0, 1, 'L');

$pdf->SetX(110);
$pdf->Cell(80, 8, 'วันที่................. เดือน........................ พ.ศ. ...................', 0, 1, 'L');

$pdf->SetXY(122, $pdf->getY()-8);
$pdf->Cell(10, 8, thaiNum(date($d)).'                '.toUTF($def_fullm_th[$m]).'             '.thaiNum($y+543), 0, 1, 'L');

$pdf->SetX(30);
$pdf->Cell(160, 8, 'เรียน เจ้ากรมแพทย์ทหารบก', 0, 1, 'L');

$pdf->SetX(60);
$pdf->Cell(130, 8, 'ข้าพเจ้า ทหารกองเกิน นาย...................................................................... อายุ...............ปี', 0, 1, 'L');
$pdf->SetXY(103, $pdf->getY()-8);
$pdf->Cell(10, 8, toUTF($user['ptname']).'                                       '.thaiNum(calcage($user['dbirth'])), 0, 1, 'L');

$pdf->SetX(30);
$pdf->Cell(160, 8, 'หมายเลขประจำตัวประชาชน...............................................................................................................................', 0, 1, 'L');
$pdf->SetXY(80, $pdf->getY()-8);
$pdf->Cell(10, 8, thaiNum($user['idcard']), 0, 1, 'L');

$pdf->SetX(30);
$pdf->Cell(160, 8, 'ที่อยู่......................................................................................................................................................................', 0, 1, 'L');
$pdf->SetXY(50, $pdf->getY()-8);
$pdf->Cell(10, 8, thaiNum(toUTF($user['address'])).' จ.'.toUTF($user['province']), 0, 1, 'L');

$pdf->SetX(30);
$pdf->Cell(160, 8, 'โทรศัพท์................................................................................................................................................................', 0, 1, 'L');
$pdf->SetXY(50, $pdf->getY()-8);
$pdf->Cell(10, 8, thaiNum($user['phone']), 0, 1, 'L');
$pdf->Ln();

$pdf->SetX(60);
$pdf->Cell(130, 8, 'ในกรณีที่ทหารกองเกินเป็นผู้ไร้ความสามารถ หรือเป็นผู้เสมือนไร้ความสามารถ และมี', 0, 1, 'L');
$pdf->SetX(30);
$pdf->Cell(130, 8, 'ผู้บริบาลเป็นผู้ให้ความยินยอม', 0, 1, 'L');

$pdf->SetX(60);
$pdf->Cell(130, 8, 'ข้าพเจ้า นาย/นาง/นางสาว....................................................................... อายุ ..............ปี', 0, 1, 'L');
$pdf->SetX(30);
$pdf->Cell(160, 8, 'หมายเลขประจำตัวประชาชน...............................................................................................................................', 0, 1, 'L');
$pdf->SetX(30);
$pdf->Cell(160, 8, 'ที่อยู่......................................................................................................................................................................', 0, 1, 'L');
$pdf->SetX(30);
$pdf->Cell(160, 8, 'โทรศัพท์................................................................................................................................................................', 0, 1, 'L');
$pdf->SetX(30);
$pdf->Cell(160, 8, 'เป็น.........................................................ของ ทหารกองเกิน......................................................................', 0, 1, 'L');
$pdf->SetXY(120, $pdf->getY()-8);
$pdf->Cell(10, 8, toUTF($user['yot_pt'].' '.$user['ptname']), 0, 1, 'L');

$pdf->SetX(60);
$pdf->Cell(130, 8, 'โดยหนังสือฉบับนี้ ข้าพเจ้ายินยอมให้ กรมแพทย์ทหารบก กองทัพบก เปิดเผยและแลกเปลี่ยน', 0, 1, 'L');
$pdf->SetX(30);
$pdf->Cell(160, 8, 'ข้อมูลของ ข้าพเจ้าทหารกองเกิน ข้อมูลที่เปิดเผยได้แก่', 0, 1, 'L');

$pdf->SetX(60);
$pdf->Cell(130, 8, '๑. ชื่อ - นามสกุล ที่อยู่ หมายเลขบัตรประจำตัวประชาชน หมายเลขโทรศัพท์ และภาพถ่าย', 0, 1, 'L');
$pdf->SetX(30);
$pdf->Cell(160, 8, 'บุคคล ภาพถ่ายบัตรประชาชน', 0, 1, 'L');

$pdf->SetX(60);
$pdf->Cell(130, 8, '๒. ประวัติการเจ็บป่วย ข้อมูลการรักษา /การผ่าตัด/การใช้ยา /ตรวจรักษาทางรังษีและ', 0, 1, 'L');
$pdf->SetX(30);
$pdf->Cell(160, 8, 'กระทำหัตถการ หรืออื่นใด และให้ถือว่าคู่ฉบับ สำเนา ภาพถ่าย ข้อมูลอิเล็กทรอนิกส์ หรือโทรสารที่ทำสำเนา', 0, 1, 'L');
$pdf->SetX(30);
$pdf->Cell(160, 8, 'ขึ้นจากหนังสือให้ความยินยอมฉบับนี้ โดยการถ่ายสำเนา ถ่ายภาพ หรือบันทึกไว้ไม่ว่าในรูปแบบใดๆ เป็น', 0, 1, 'L');
$pdf->SetX(30);
$pdf->Cell(160, 8, 'หลักฐานในการให้ความยินยอมของเข้าพเจ้าเช่นเดียวกัน', 0, 1, 'L');

$pdf->SetX(60);
$pdf->Cell(130, 8, 'การใช้ข้อมูลดังกล่าวข้างต้นเพื่อให้หน่วยงานราชการที่เกี่ยวข้องเป็นประโยชน์ในการดำเนินการ', 0, 1, 'L');
$pdf->SetX(30);
$pdf->Cell(160, 8, 'ตรวจคัดเลือกทหารกองเกินเข้าเป็นทหารกองประจำการ', 0, 1, 'L');

$pdf->SetX(60);
$pdf->Cell(130, 8, 'ข้าพเจ้าได้เข้าใจข้อความในหนังสือยินยอมฉบับนี้โดยตลอดแล้ว จึงได้ลงลายมือชื่อไว้เป็น', 0, 1, 'L');
$pdf->SetX(30);
$pdf->Cell(160, 8, 'หลักฐานต่อหน้าพยาน ณ วัน เดือน ปี ที่ระบุข้างต้น', 0, 1, 'L');
$pdf->Ln();

$pdf->SetX(70);
$pdf->Cell(0, 8, 'ลงชื่อ.........................................................ทหารกองเกิน/ผู้ให้ความยินยอม', 0, 1, 'L');
$pdf->SetX(70);
$pdf->Cell(0, 8, '      (.........................................................)', 0, 1, 'L');
$pdf->SetX(70);
$pdf->Cell(0, 8, 'ลงชื่อ.........................................................พยาน', 0, 1, 'L');
$pdf->SetX(70);
$pdf->Cell(0, 8, '      (.........................................................)', 0, 1, 'L');

$pdf->AutoPrint(true);
$pdf->Output();