<?php

include 'bootstrap.php';
include 'fpdf_thai/shspdf.php';

$db = Mysql::load();
$db->select("SELECT `idcard`, CONCAT(`yot`,' ',`name`,' ',`surname`) AS `ptname` 
FROM `opcard` 
WHERE `hn` = '47-1'");
$user = $db->get_item();

$pdf = new SHSPdf('P', 'mm', 'A4');
$pdf->SetThaiFont(); // เซ็ตฟอนต์
$pdf->SetAutoPageBreak(false, 0);
$pdf->SetMargins(30, 19, 20, 25); // left, top, right
$pdf->AddPage();
$pdf->SetFont('THSarabun','',16); // เรียกใช้งานฟอนต์ที่เตรียมไว้

$pdf->SetXY(30, 19);
$pdf->Image('images/ks_025_2.png', 94, 19, 30, 30, 'PNG');

$pdf->SetXY(30, 39);
$at_number = to_thai_number('123456');
$pdf->Cell(47, 5, 'ที่ กห ๐๔๘๓.๖๓.๔/'.$at_number, 1, 1);

$pdf->SetXY(145, 39);
$pdf->MultiCell(45, 5, 'โรงพยาบาลค่ายสุรศักดิ์มนตรี'."\n".'ตำบลพิชัย อำเภอเมือง'."\n".'จังหวัดลำปาง ๕๒๐๐๐', 1, 'L');

// @todo
$pdf->SetXY(110, 59);
$day = to_thai_number('12');
$pdf->Cell(0, 5, $day.' พฤศจิกายน ๒๕๕๙', 1, 1, 'L');

$pdf->SetXY(30, 69);
$pdf->Cell(0, 5, 'เรื่อง ขอส่งตัวผู้ป่วยสิทธิหลักประกันสุขภาพถ้วนหน้า รักษาต่อ', 1, 1);
$pdf->SetXY(30, 79);
$pdf->Cell(0, 5, 'เรียน ผู้อำนวยการโรงพยาบาลลำปาง', 1, 1);

$pdf->SetXY(55, 89);
$pdf->Cell(0, 5, 'โรงพยาบาลค่ายสุรศักดิ์มนตรี ขอส่ง..........................................................หมายเลขประจำตัว', 1, 1);
$pdf->SetXY(108, 89);
$pdf->Cell(0, 5, $user['ptname'], 1, 1);

$pdf->SetXY(30, 94);
$pdf->Cell(0, 5, '....................................................................... ซึ่งเป็นผู้ป่วยบัตรประกันสุขภาพถ้วนหน้า และเลือกโรงพยาบาล', 1, 1);
$pdf->SetXY(45, 94);
$idcard = to_thai_number($user['idcard']);
$pdf->Cell(0, 5, $idcard, 1, 1);

$pdf->SetXY(30, 99);
$pdf->Cell(0, 5, 'ค่ายสุรศักดิ์มนตรีเป็นสถานพยาบาลหลักมารักษาพบาบาลต่อ จึงขอความร่วมมือท่านให้การรักษาพยาบาล', 1, 1);
$pdf->SetXY(30, 104);
$pdf->Cell(0, 5, 'ตามความเหมาะสม ส่วนค่าใช้จ่ายในการรักษานั้นขอให้ส่งหลักฐานเรียกเก็บตามระเบียบ ต่อไป', 1, 1);

$pdf->SetXY(55, 114);
$pdf->Cell(0, 5, 'จึงเรียนมาเพื่อทราบ และขอขอบคุณมา ณ โอกาสนี้', 1, 1);

$pdf->SetXY(110, 124);
$pdf->Cell(80, 5, 'ขอแสดงความนับถือ', 1, 1, 'C');

$pdf->SetXY(110, 144);
$pdf->Cell(0, 5, 'พันโท', 1, 1);
$pdf->SetXY(110, 149);
$pdf->Cell(0, 5, '( มนต์ชัย พรพัฒนะเจริญชัย )', 1, 1,'C');
$pdf->SetXY(110, 154);
$pdf->Cell(0, 5, 'เลขานุการโครงการหลักประกันสุขภาพแห่งชาติ', 1, 1,'C');
$pdf->SetXY(110, 159);
$pdf->Cell(0, 5, 'โรงพยาบาลค่ายสุรศักดิ์มนตรี', 1, 1,'C');

$pdf->SetXY(30, 179);
$pdf->Cell(0, 5, 'หมายเหตุ - ๑. หนังสือรับรองสิทธิฉบับนี้ใช้สำหรับการตรวจรักษาที่โรงพยาบาล.....................................เท่านั้น', 0, 1);
$pdf->SetXY(48, 184);
$pdf->Cell(0, 5, '๒. ใช้สำหรับการตรวจรักษาในวันที่.......................................................................................เท่านั้น', 0, 1);

$pdf->SetXY(30, 199);
$pdf->Cell(0, 5, 'กองทุนหลักประกันสุขภาพแห่งชาติ', 0, 1);
$pdf->Cell(0, 5, 'โรงพยาบาลค่ายสุรศักดิ์มนตรี', 0, 1);
$pdf->Cell(0, 5, 'โทร. (๐๕๔) ๘๓๙๓๐๕ - ๘ ต่อ ๑๑๒๔', 0, 1);
$pdf->Cell(0, 5, 'โทรสาร. (๐๕๔) ๘๓๙๓๑๐', 0, 1);

// $pdf->AutoPrint(true);
$pdf->Output();