<?php

include 'bootstrap.php';

$db = Mysql::load();

$items = array(
'154990045115' => '¾§ÈìÈÑ¡´Ôì',
'155990025561' => '»¯ÔÀÒ³',
'157990064882' => '¸¹¡Ò¹µì',
'152990084924' => 'Ã³ªÑÂ',
'152990086059' => 'ÍÃÃ¶¾Å',
'154990037335' => 'ÇÑ²³¾§Èì',
'152010010349' => '¨Ñ¡ÃÇÒÅ',
'1520500113' => 'ÇÑ¹à©ÅÔÁ',
'110290002138' => '¡ÄÉ´Ò',
'152020004804' => 'ÀÙÁÔ¹·Ãì',
'152010011439' => 'ÇÃÇÑ²¹ì',
'1521300051' => 'Í¹ØÃÑ¡Éì',
'152990083444' => '¡ÕÃµÔ',
'1570300142' => 'ÊØ¡ÄÉ®Ôì',
'1539900527' => '¾ªÃ¾§Èì',
'152990066041' => '³Ñ°ÇØ²Ô',
'1520800122' => '¹Ñ°¾Å',
'155990025866' => 'ÍÃÃ¶ÊÔ·¸Ôì',
'152990075436' => 'ÂÍ´ªÕÇÔ¹',
'152990084516' => '°ÔµÔ¾Ñ¹¸ì',
'157990069339' => 'ÁËÒÊÁØ·Ã',
'156010040615' => 'ÊÒ¸Ôµ',
'157990054418' => 'à¡ÃÔ¡Ä·¸Ôì',
'1540700041' => '¾ÃÐªÃÒÂØ·¸',
'165990069562' => '³Ñ°ÇÑµÃ'
);

$where = '';
foreach ($items as $idcard => $name) {
    $where .= " OR ( `idcard` LIKE '$idcard%' AND `name` = '$name' ) <br>";
}

$sql = "SELECT `idcard`, `name`
FROM `opcard` 
WHERE 1 = 1 
$where";

echo $sql;
